Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF4455.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="UEP7" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="UEP7" edc:nzwidth="0x8" edc:por="---00000" edc:_addr="0xF77">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EPSTALL" edc:desc="" edc:mask="0x1" edc:name="EPSTALL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPINEN" edc:desc="" edc:mask="0x1" edc:name="EPINEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPOUTEN" edc:desc="" edc:mask="0x1" edc:name="EPOUTEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPCONDIS" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPHSHK" edc:desc="" edc:mask="0x1" edc:name="EPHSHK" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="EP7STALL" edc:desc="" edc:mask="0x1" edc:name="EP7STALL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP7INEN" edc:desc="" edc:mask="0x1" edc:name="EP7INEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP7OUTEN" edc:desc="" edc:mask="0x1" edc:name="EP7OUTEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP7CONDIS" edc:desc="" edc:mask="0x1" edc:name="EP7CONDIS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EP7HSHK" edc:desc="" edc:mask="0x1" edc:name="EP7HSHK" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:SFRFieldDef edc:cname="EPSTALL7" edc:desc="" edc:mask="0x1" edc:name="EPSTALL7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPINEN7" edc:desc="" edc:mask="0x1" edc:name="EPINEN7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPOUTEN7" edc:desc="" edc:mask="0x1" edc:name="EPOUTEN7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPCONDIS7" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPHSHK7" edc:desc="" edc:mask="0x1" edc:name="EPHSHK7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="UEP8" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="UEP8" edc:nzwidth="0x8" edc:por="---00000" edc:_addr="0xF78">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EPSTALL" edc:desc="" edc:mask="0x1" edc:name="EPSTALL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPINEN" edc:desc="" edc:mask="0x1" edc:name="EPINEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPOUTEN" edc:desc="" edc:mask="0x1" edc:name="EPOUTEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPCONDIS" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPHSHK" edc:desc="" edc:mask="0x1" edc:name="EPHSHK" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="EPSTALL8" edc:desc="" edc:mask="0x1" edc:name="EPSTALL8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPINEN8" edc:desc="" edc:mask="0x1" edc:name="EPINEN8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPOUTEN8" edc:desc="" edc:mask="0x1" edc:name="EPOUTEN8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPCONDIS8" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPHSHK8" edc:desc="" edc:mask="0x1" edc:name="EPHSHK8" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="UEP9" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="UEP9" edc:nzwidth="0x8" edc:por="---00000" edc:_addr="0xF79">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EPSTALL" edc:desc="" edc:mask="0x1" edc:name="EPSTALL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPINEN" edc:desc="" edc:mask="0x1" edc:name="EPINEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPOUTEN" edc:desc="" edc:mask="0x1" edc:name="EPOUTEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPCONDIS" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPHSHK" edc:desc="" edc:mask="0x1" edc:name="EPHSHK" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="EPSTALL9" edc:desc="" edc:mask="0x1" edc:name="EPSTALL9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPINEN9" edc:desc="" edc:mask="0x1" edc:name="EPINEN9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPOUTEN9" edc:desc="" edc:mask="0x1" edc:name="EPOUTEN9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPCONDIS9" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPHSHK9" edc:desc="" edc:mask="0x1" edc:name="EPHSHK9" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="UEP10" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="UEP10" edc:nzwidth="0x8" edc:por="---00000" edc:_addr="0xF7A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EPSTALL" edc:desc="" edc:mask="0x1" edc:name="EPSTALL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPINEN" edc:desc="" edc:mask="0x1" edc:name="EPINEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPOUTEN" edc:desc="" edc:mask="0x1" edc:name="EPOUTEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPCONDIS" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPHSHK" edc:desc="" edc:mask="0x1" edc:name="EPHSHK" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="EPSTALL10" edc:desc="" edc:mask="0x1" edc:name="EPSTALL10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPINEN10" edc:desc="" edc:mask="0x1" edc:name="EPINEN10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPOUTEN10" edc:desc="" edc:mask="0x1" edc:name="EPOUTEN10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPCONDIS10" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPHSHK10" edc:desc="" edc:mask="0x1" edc:name="EPHSHK10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="UEP11" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="UEP11" edc:nzwidth="0x8" edc:por="---00000" edc:_addr="0xF7B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EPSTALL" edc:desc="" edc:mask="0x1" edc:name="EPSTALL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPINEN" edc:desc="" edc:mask="0x1" edc:name="EPINEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPOUTEN" edc:desc="" edc:mask="0x1" edc:name="EPOUTEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPCONDIS" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EPHSHK" edc:desc="" edc:mask="0x1" edc:name="EPHSHK" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="EPSTALL11" edc:desc="" edc:mask="0x1" edc:name="EPSTALL11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPINEN11" edc:desc="" edc:mask="0x1" edc:name="EPINEN11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPOUTEN11" edc:desc="" edc:mask="0x1" edc:name="EPOUTEN11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPCONDIS11" edc:desc="" edc:mask="0x1" edc:name="EPCONDIS11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EPHSHK11" edc:desc="" edc:mask="0x1" edc:name="EPHSHK11" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
